data_generation/simulation_results/openfoam/case_68/constant/simParams
nIter 2000;
hComponent0 792.2219455181873;
hComponent1 1412.9272865631533;
hComponent2 775.0648712726436;
hComponent3 873.7850421883595;
hComponent4 1374.0852411587484;kComponent0 92.54781725495495;
kComponent1 32.72865920676428;
kComponent2 69.28910024187357;
kComponent3 67.01661392291739;
kComponent4 65.55109666318754;
tAmbient 300;
Ux 2.798855600481535;
kPCB 0.29989050963464614;