data_generation/simulation_results/openfoam/case_68/system/component_4/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../../constant/simParams"

v_CPU_AbsoluteEnergySource
{
    type            scalarSemiImplicitSource;
    active          true;

    selectionMode   cellZone;
    cellZone         component_4;
    volumeMode      absolute;

    sources
    {
        h           ( $hComponent4 0 );
    }
}

limitT
{
    type       limitTemperature;
    min        250;
    max        6000;
    selectionMode all;
}


// ************************************************************************* //
